blog/sudo.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-06-22 Wed 14:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>关于 sudo 的一些事</title>
<meta name="author" content="Siqing Mu" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="https://www.khow.me/blog/images/favicon.ico" /><link rel="stylesheet" type="text/css" href="./css/site.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">关于 sudo 的一些事</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgaf90df9">1. 为何选择sudo?</a></li>
<li><a href="#org8dcaf19">2. 用户和sudo</a>
<ul>
<li><a href="#orgd7fb5f4">2.1. 验证sudo会员资格</a></li>
</ul>
</li>
<li><a href="#org54bb295">3. 使用sudo创建用户</a></li>
<li><a href="#orgfa5796f">4. 配置概述</a></li>
<li><a href="#org7424c24">5. 需要root密码</a></li>
</ul>
</div>
</div>
<p>
SRC:<a href="https://wiki.debian.org/sudo">https://wiki.debian.org/sudo</a>
</p>

<blockquote>
<p>
Sudo(Super-user do) 是被设计为让系统管理员允许普通用户作为超级用户或另一用户来执行某些命令的工具。基本理念是尽可能少地提供特权，但仍然允许人们完成他们的工作，Sudo 也是记录谁允许哪些命令以及何时运行的有效方法。
</p>
</blockquote>

<div id="outline-container-orgaf90df9" class="outline-2">
<h2 id="orgaf90df9"><span class="section-number-2">1.</span> 为何选择sudo?</h2>
<div class="outline-text-2" id="text-1">
<p>
使用sudo比以root身份打开会话更好（更安全），原因有很多，其中包括：
</p>

<ul class="org-ul">
<li>没有人需要知道root密码（sudo提示输入当前用户的密码）。可以临时授予个人用户额外的权限，然后在不需要更改密码的情况下将其删除。</li>
<li>通过sudo可以运行需要特殊权限的命令; 作为普通用户，可以减少了错误导致的系统危害。</li>
<li>审计/日志记录：执行sudo命令时，将记录原始用户名和命令。</li>
</ul>

<p>
由于上述原因，通常不推荐使用sudo -i (或sudo su) 切换到root，因为它取消了上述功能。
</p>
</div>
</div>

<div id="outline-container-org8dcaf19" class="outline-2">
<h2 id="org8dcaf19"><span class="section-number-2">2.</span> 用户和sudo</h2>
<div class="outline-text-2" id="text-2">
<p>
为了让用户运行sudo，用户必须属于group = sudo。
</p>
</div>

<div id="outline-container-orgd7fb5f4" class="outline-3">
<h3 id="orgd7fb5f4"><span class="section-number-3">2.1.</span> 验证sudo会员资格</h3>
<div class="outline-text-3" id="text-2-1">
<p>
以用户身份登录后，您可以使用id或groups命令验证用户是否属于group = sudo。例如，id = foo的用户应该看到输出
</p>
<div class="org-src-container">
<pre class="src src-bash">groups
</pre>
</div>

<pre class="example">
foot sudo
</pre>

<p>
如果输出中不存在sudo,则用户不属于该组。类似地，来自command=id的更复杂和可变的输出应该类似于
</p>

<pre class="example" id="org6d02544">
uid = 1001（foo）gid = 1001（foo）groups = 1001（foo），27（sudo）
</pre>

<p>
从命令行添加现有用户，比如，要将id = foo的现有用户添加到group = sudo：
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo adduser foo sudo
</pre>
</div>

<p>
或者，你可以先获得root（例如，sudo su  -），然后运行相同的命令，不带prefix = sudo：
</p>

<div class="org-src-container">
<pre class="src src-bash">adduser foo
adduser foo sudo
</pre>
</div>

<p>
添加到新组后，用户必须注销然后再次重新登录才能使新组生效。组仅在登录时分配给用户。最常见的混淆源是人们将自己添加到一个新组，但之后不再注销并重新登录，然后因为没有分配组而出现问题; 一定要验证组成员身份。
</p>
</div>
</div>
</div>

<div id="outline-container-org54bb295" class="outline-2">
<h2 id="org54bb295"><span class="section-number-2">3.</span> 使用sudo创建用户</h2>
<div class="outline-text-2" id="text-3">
<p>
您还可以使用sudo成员身份创建新用户：
</p>

<p>
安装OS时创建新用户
从DebianSqueeze开始，如果你在安装过程中给root一个空密码，sudo将被安装，第一个用户将能够使用它获得root访问权限（目前，用户将被添加到sudo组）。系统还将配置gksu和aptitude以使用sudo。以安装的用户身份登录后，您仍应验证组成员身份。
</p>

<p>
从命令行创建新用户
已经拥有sudo的用户可以使用命令行中的sudo组成员身份创建另一个用户（例如id = foo）：
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo adduser foo
sudo adduser foo sudo
</pre>
</div>

<p>
然后，您应该以新用户身份登录并验证组成员身份。
</p>
</div>
</div>

<div id="outline-container-orgfa5796f" class="outline-2">
<h2 id="orgfa5796f"><span class="section-number-2">4.</span> 配置概述</h2>
<div class="outline-text-2" id="text-4">
<p>
现在，如果您想允许某些用户执行某些程序，这里有一个简单的例子（有关更多信息，请阅读详细手册）。
</p>

<pre class="example" id="orga192bb5">
# /etc/sudoers
#
# This file MUST be edited with the 'visudo' command as root.
#
# See the man page for details on how to write a sudoers file.
#

Defaults        env_reset
Defaults        secure_path="/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin"

# Host alias specification
User_Alias      MYADMINS = jdoe

# User alias specification

# Cmnd alias specification
Cmnd_Alias      SHUTDOWN = /sbin/reboot, /sbin/poweroff
Cmnd_Alias      PKGMGMT = /usr/bin/dpkg, /usr/bin/apt-get, /usr/bin/aptitude

# User privilege specification

# Users listed above (MYADMINS) can run package managers and reboot the system.
MYADMINS ALL = PKGMGMT, SHUTDOWN

# Allow members of group sudo to execute any command
%sudo   ALL=(ALL:ALL) ALL

#Default rule for root.
root    ALL=(ALL) ALL

#includedir /etc/sudoers.d
</pre>
</div>
</div>

<div id="outline-container-org7424c24" class="outline-2">
<h2 id="org7424c24"><span class="section-number-2">5.</span> 需要root密码</h2>
<div class="outline-text-2" id="text-5">
<p>
如果您想要使用root密码来使用sudo而不是用户密码，请添加以下行：
</p>

<pre class="example" id="org983516d">
Defaults   rootpw
</pre>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="disqus_thread"></div>
            <script type="text/javascript">
            var disqus_shortname = 'seymer';
            (function() {
                    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
            </script>
            <script>
              (function(i,s,o,g,r,a,m){i['GoogleAnalyticsObject']=r;i[r]=i[r]||function(){
                      (i[r].q=i[r].q||[]).push(arguments)},i[r].l=1*new Date();a=s.createElement(o),
                      m=s.getElementsByTagName(o)[0];a.async=1;a.src=g;m.parentNode.insertBefore(a,m)
                      })(window,document,'script','//www.google-analytics.com/analytics.js','ga');

              ga('create', 'UA-110114842-1', 'auto');
              ga('send', 'pageview');
            </script>
</div>
</body>
</html>
